![](images/09_02.png)

In [2]:
df = read.table("./data/Table6.txt", skip=1,
               header = TRUE,
               flush = TRUE,
               comment.char = '@',
               stringsAsFactors = FALSE)

In [3]:
head(df)

  Name   Age Height Weight Sex
1 Alex   25  177    57     F
2 Lilly  31  163    69     F
3 Mark   23  190    83     M
4 Oliver 52  179    75     M
5 Martha 76  163    70     F
6 Lucas  49  183    83     M

In [4]:
library('tidyverse')

── Attaching packages ─────────────────────────────────────── tidyverse 1.3.1 ──

✔ ggplot2 3.3.5     ✔ purrr   0.3.4
✔ tibble  3.1.2     ✔ dplyr   1.0.7
✔ tidyr   1.1.3     ✔ stringr 1.4.0
✔ readr   1.4.0     ✔ forcats 0.5.1

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

In [5]:
df = df %>% unique()

In [6]:
df

  Name     Age Height Weight Sex
1 Alex     25  177    57     F
2 Lilly    31  163    69     F
3 Mark     23  190    83     M
4 Oliver   52  179    75     M
5 Martha   76  163    70     F
6 Lucas    49  183    83     M
7 Caroline 26  164    53     F

In [9]:
rownames(df) = df$Name
df$Name = NULL

In [10]:
df

         Age Height Weight Sex
Alex     25  177    57     F
Lilly    31  163    69     F
Mark     23  190    83     M
Oliver   52  179    75     M
Martha   76  163    70     F
Lucas    49  183    83     M
Caroline 26  164    53     F

In [11]:
write.table(df, file="./data/Table6_new.txt", sep="\t")

In [13]:
df_new = read.table("./data/Table6_new.txt")

In [14]:
df_new

         Age Height Weight Sex
Alex     25  177    57     F
Lilly    31  163    69     F
Mark     23  190    83     M
Oliver   52  179    75     M
Martha   76  163    70     F
Lucas    49  183    83     M
Caroline 26  164    53     F